app/controllers/admin/active_users_controller.rb

	def edit
		@user = User.find_using_perishable_token(params[:id])
		if @user
			if @user.update_attributes(:status => true)
---
SELECT * FROM `users` WHERE (perishable_token = 'Mum51qBSZXRMOYRs3rDS' and updated_at > '2009-09-17 13:19:40') LIMIT 1
UPDATE `users` SET `updated_at` = '2009-09-17 14:01:43', `perishable_token` = 'xFmEnU-JaNUChuBMVRhj', `last_request_at` = '2009-09-17 14:01:43' WHERE `id` = 1