app/controllers/admin/cars_controller.rb

SELECT * FROM `cars`
---
  def index
    @cars = Car.all

SELECT * FROM `cars` WHERE (`cars`.`id` = 1)
---
  def show
    @car = Car.find(params[:id])

SELECT * FROM "cars" WHERE ("cars"."id" = 1)
---
  def edit
    @car = Car.find(params[:id])

INSERT INTO `cars` (`model`, `created_at`, `updated_at`, `fuel`, `color`, `mark`, `year`, `description`) VALUES('Gol', '2009-09-17 14:00:54', '2009-09-17 14:00:54', 'Flex', 'Preto', 'VW', 2009, 'Duas Portas')
---
  def create
    @car = Car.new(params[:car])

    respond_to do |format|
      if @car.save

SELECT * FROM "cars" WHERE ("cars"."id" = 1)
---
  def update
    @car = Car.find(params[:id])