app/controllers/admin/images_controller.rb

  def new
    @car = Car.find(params[:car_id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 1)

 def create
    @car = Car.find(params[:car_id])
    @image = @car.images.new(params[:image])
    respond_to do |format|
      if @image.save
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 1)
INSERT INTO `images` (`created_at`, `imageble_type`, `updated_at`, `picture_content_type`, `picture_updated_at`, `imageble_id`, `picture_file_name`, `picture_file_size`, `description`) VALUES('2009-09-17 14:54:05', 'Car', '2009-09-17 14:54:05', 'image/jpeg', '2009-09-17 14:54:03', 1, 'wallpaper.jpg', 53741, 'carro bunitinho')

  def edit
    @car = Car.find(params[:car_id])
    @image = Image.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 2)
SELECT * FROM `images` WHERE (`images`.`id` = 1)

	def destroy
	  @car = Car.find(params[:car_id])
    @image = Image.find(params[:id])
    @image.destroy
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 2)
SELECT * FROM `images` WHERE (`images`.`id` = 4)
DELETE FROM `images` WHERE `id` = 4