app/controllers/admin/password_resets_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'rodrigo.engenharia@gmail.com') LIMIT 1
---
	def create
		@user = User.find_by_email(params[:email])

UPDATE `users` SET `updated_at` = '2009-09-17 13:54:38', `crypted_password` = 'ad738dfee04b62028802bc043f9dda888947255d6aea51c75bd47984e0dc83c20bb990dd0c7ffdfb3e26a01542e18a4ae05998887c9c2b03c38c18cf9311fcf8', `perishable_token` = '2AwnuddCE7rGr-Q7SxDV', `last_login_at` = '2009-09-17 13:51:23', `last_login_ip` = '127.0.0.1', `current_login_at` = '2009-09-17 13:54:38', `password_salt` = 'ElQBW_reFUDcSTWHNypO', `login_count` = 2, `persistence_token` = '3caf87f4e5b8c1322e03fe28fcdccc89b014260e931e74af1d506db38ad64cddf011e158c909aa28e76846ce0abf62c0b5ac89de51586105ccbf816e97fe0e89', `last_request_at` = '2009-09-17 13:54:38' WHERE `id` = 1
---
	def update
		@user.password = params[:user][:password]
		@user.password_confirmation = params[:user][:password_confirmation]
		if @user.save

SELECT * FROM `users` WHERE (perishable_token = 'JPlHh5BJnxdJADamjlAN' and updated_at > '2009-09-17 13:30:54') LIMIT 1
---
	def load_user_using_perishable_token
		@user = User.find_using_perishable_token(params[:id])