app/controllers/admin/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `last_request_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `status`, `last_login_at`, `email`) VALUES('2009-09-17 13:29:02', '2009-09-17 13:29:02', '7a6ebe7737afce6598f1ead546759a876bd231b521cea4218d1b952d6f46eed2232b36e1872968ac6df7d6aa897b4e8d24f5f00ebe3bfeea2d3ec5bef8c58d17', 'Mum51qBSZXRMOYRs3rDS', '2009-09-17 13:29:02', 0, '127.0.0.1', 'wGWtfN2KRkpjuYZcCUBj', '2009-09-17 13:29:02', 'c538f9ec591ca0d8c30fd7cff8eff7a165808a9d046407cd4461b9b3c5f664b774e756b1c22dcd90b4d4156820629208a6f65e51f274838fe26381bfdf0b7025', 1, NULL, 'rodrigo', 0, NULL, 'rodrigo.engenharia@gmail.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
UPDATE "users" SET "login_count" = 2, "persistence_token" = 'a784ee59b5ad24b93eef0341b2db6f9acef0884e297f0b0641a1b378e6a33fcaf7c426d02cbaa0dab1c789a7ec4dd60e8d3c2073e8c854f5ec8e3ec614e94bcf', "updated_at" = '2009-09-16 23:46:06', "perishable_token" = 'avSRQ_PMdPAW9tRt92B3', "last_request_at" = '2009-09-16 23:46:06', "last_login_at" = '2009-09-16 23:42:30', "last_login_ip" = '127.0.0.1', "current_login_at" = '2009-09-16 23:46:06', "password_salt" = 'jofTmP91fxRJOYDAg6sm', "crypted_password" = '9b5b2e66c4e7bb67e5a2fb5e291951db0f716e566ed370386afeed9bb7f05c42a1cc4c76e652bc6cebf4a445b1dafd10491d04c59cdc5ab213da43ef517b393d' WHERE "id" = 1