app/controllers/home_controller.rb

  def index
    @cars = Car.all
---
SELECT * FROM `cars`